Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/losing_your_home/home_repossession.html.txt.tmx
Source language: en
Languages: ga

source: • Legal issues affecting repossessions
ga: • Saincheisteanna dlí a dhéanann difear d’athshealbhú

source: • The legal processes involved in repossession
ga: • Na próisis dhlíthiúla a bhaineann le hathshealbhú tí

source: • Other debts and loans
ga: • Fiachais agus iasachtaí eile

source: When you take out a mortgage to buy a property, you offer the property as security for the mortgage debt
ga: Nuair a ghlacann tú morgáiste chun réadmhaoin a cheannach, déanann tú an réadmhaoin a thairgeadh mar urrús d’fhiachas an mhorgáiste

source: If you are unable to pay the mortgage, you may be faced with repossession
ga: Murar féidir leat an morgáiste a íoc, d’fhéadfadh go ndéanfaí an réadmhaoin a athshealbhú

source: If you are having difficulties paying your mortgage, you should talk to the lending institution as soon as possible
ga: Má tá fadhb agat ag íoc do morgáiste, ba chóir duit labhairt leis an institiúid iasachtaí chomh luath agus is féidir

source: Our overview of mortgage debt describes what you can do if you risk falling into arrears, and we also describe the codes of conduct for mortgage lenders
ga: Tá cur síos inár bhForbhreathnú ar fhiachas morgáiste ar an méid is féidir leat a dhéanamh má tá tú i mbaol titim i riaráistí le do mhorgáiste agus déanaimid cur síos freisin ar Chóid um chosaint tomhaltóirí agus fiachas morgáiste

source: Your lender must must take certain steps to deal with any problems you have in paying your mortgage
ga: Caithfidh d’iasachtóir céimeanna áirithe a thógáil chun déileáil le fadhbanna ar bith atá agat ag íoc morgáiste

source: Repossessing your home should be the lender's last resort
ga: Ba chóir go mbeadh athshealbhú tí mar bheart deiridh ag iasachtóir

source: Other debts and loans
ga: Iasachtaí agus fiachais eile

source: Even if you have no mortgage on your home, it could be in danger of repossession if you have other debts
ga: Fiú mura bhfuil morgáiste tí agat, d’fhéadfadh baol athshealbhaithe a bheith ann má tá fiachais eile agat

source: If you build up other debts and are unable to repay them then the people to whom you owe money may register that debt as a judgment mortgage against your house, flat or apartment and seek to recover their money in that way - see ‘Other debts and loans' below
ga: Má charnaíonn tú fiachais eile agus nach bhfuil tú ábalta iad a aisíoc, d’fhéadfadh na daoine lena bhfuil airgead le haisíoc agat an fiachas a chlárú mar bhreithiúnas morgáiste in aghaidh do thí nó árasáin agus iarracht a dhéanamh an t-airgead a aisghabháil ar an mbealach sin (féach ‘Fiachais agus iasachtaí eile’ thíos)

source: If your home is being repossessed
ga: Má tá do theach á athshealbhú

source: If you have exhausted all the options open to you, the lender can repossess your home in order to recover the amount you owe
ga: Má tá gach rogha spíonta agat, is féidir leis an iasachtóir do theach a athshealbhú chun an méid a tá aige ort a fháil

source: If you do not agree to the repossession, the lender may take you to court
ga: Mura n-aontaíonn tú le hathshealbhú do thí, is féidir leis an iasachtóir tú a thabhairt chun na cúirte

source: The legal processes are described in detail below
ga: Déanaimid mionchuntas ar na próisis dhlíthiúla

source: When your home is to be repossessed, you will need to find somewhere else to live
ga: Nuair atá do theach á athshealbhú, beidh ort áit chónaithe eile a aimsiú

source: You can apply to the local authority (county or city council) to be housed
ga: Is féidir leat iarraidh ar an údarás áitiúil (comhairle contae nó cathrach) áit chónaithe a sholáthar duit

source: There are also a number of voluntary housing associations which provide social housing
ga: Is féidir freisin iarratas a chur ar chumann tithíochta

source: If you rent from a private landlord, you may qualify for a Rent Supplement or a Housing Assistance Payment (HAP) to help with the rent
ga: Má fhaigheann tú áit chónaithe ar cíos ó thiarna talún príomháideach, b'fhéidir go mbeidh tú ábalta Forlíonadh Cíosa a fháil chun cabhrú leat an cíos a íoc

source: If you cannot find anywhere to live, our document on housing and other supports for homeless people may be useful
ga: Munar féidir leat áit chónaithe ar bith a aimsiú, d'fhéadfá faisnéis úsáideach a fháil inár ndoiciméad Roghanna tithíochta do dhaoine gan dídean

source: Legal issues affecting repossessions
ga: Saincheisteanna dlí a dhéanann difear d’athshealbhú

source: In 2011, a High Court decision established that there were legal difficulties with getting orders for possession of certain properties
ga: In 2011, rinne an Ard-Chúirt cinneadh a dheimhnigh go raibh deacrachtaí dlíthiúla ann maidir le horduithe a fháil d’athshealbhú roinnt réadmhaoine

source: This decision was made in a number of cases where mortgage providers were applying to repossess mortgaged property
ga: Rinneadh an cinneadh seo i líon cásanna ina raibh iarratas á dhéanamh ag soláthróirí morgáiste chun réadmhaoin a bhí ar morgáiste a athshealbhú

source: Put simply, the decision meant that, in the case of mortgages created before 1 December 2009, it was very difficult for a mortgage provider to get an order for possession unless the court proceedings were started before that date
ga: Go simplí, chiallaigh an cinneadh, i gcás morgáistí a cruthaíodh roimh an 1 Nollaig 2009, go raibh sé an-deacair do sholáthróir morgáiste ordú le haghaidh athshealbhú a fháil murar tosaíodh na himeachtaí cúirte roimh an dáta sin

source: This situation arose because the law was changed on 1 December 2009
ga: Thainig an cás seo chun solais mar gheall gur athraíodh an dlí an 1 Nollaig 2009

source: An existing law governing repossessions was repealed by the Land and Conveyancing Law Reform Act 2009, which provided for repossessions but applied only to mortgages created after it came into effect
ga: D'fhoráil an dlí nua (an tAcht um Athchóiriú an Dlí Talún agus Tíolactha, 2009) d’athshealbhú ach níor bhain sé ach le morgáistí a cruthaíodh tar éis gur tháinig an tAcht i bhfeidhm

source: The Land and Conveyancing Law Reform Act 2013 was introduced to remedy the legal difficulties described above
ga: Tugadh an tAcht um Athchóiriú an Dlí, Talún agus Tíolactha, 2013 isteach chun na deacrachtaí dlí a ndéantar cur síos orthu thuas a réiteach

source: It also provides for a court to adjourn repossession proceedings for up to 2 months in certain situations, to allow the possibility of a Personal Insolvency Arrangement (PIA) to be explored as an alternative to repossession
ga: Anuas air sin, déantar foráil go gcuirfidh cúirt imeachtaí athshealbhaithe ar athló ar feadh a mhéid le 2 mhí i gcásanna áirithe, go ndéanfaí féidearthacht Socrú Dócmhainneachta Pearsanta (SDP) a fhiosrú mar rogha eile ar athshealbhú

source: The legal processes involved in repossession
ga: Na próisis dhlíthiúla a bhaineann le hathshealbhú tí

source: If you agree to have your home repossessed
ga: Má aontaíonn tú le hathshealbhú tí

source: You can consent to have your home repossessed
ga: Is féidir leat toiliú le hathshealbhú tí

source: You may agree terms with your lender for the sale of the house, if you are unable to pay your mortgage
ga: Is féidir leat téarmaí a chomhaontú le d’iasachtóir do dhíol an tí, mura bhfuil tú ábalta do mhorgáiste a íoc

source: The lending institution must get a court order to repossess or sell your house unless you consent in writing 7 days before the repossession or sale
ga: Ní mór don institiúid iasachta ordú cúirte a fháil chun do theach a athshealbhú nó a dhíol mura bhfuil toiliú faighte uait i scríbhinn 7 lá roimh an athshealbhú nó roimh an díolachán

source: If the issue has to go to court, you are generally liable for the costs of the court action
ga: Má théann an cás chun na cúirte, bíonn tú faoi dhliteanas ag costais na caingne dlí go hiondúil

source: In some cases, the lending institution may have difficulty in finding a buyer who would be willing to buy the house unless there is what is known as a well-charging order in place
ga: I gcásanna áirithe, d’fhéadfadh sé a bheith deacair ar an institiúid iasachta ceannaitheoir a aimsiú a bheadh sásta an teach a cheannach mura bhfuil ordú iontaofa i bhfeidhm

source: This is a court order which, among other things, allows for the sale of the property
ga: Is ordú cúirte é seo le gur féidir an réadmhaoin a dhíol i measc rudaí eile

source: If you don’t agree to have your home repossessed
ga: Mura n-aontaíonn tú le hathshealbhú tí

source: If you haven’t agreed a repayment plan with the lender, or you have been unable to meet the payment arranged by a repayment plan, the lender may take you to court to repossess your home
ga: Mura chomhaontaigh tú plean aisíocaíochta leis an iasachtóir nó mura raibh tú in ann an íocaíocht arna shocrú sa phlean aisíocaíochta a dhéanamh d’fhéadfadh an t-iasachtóir tú a thabhairt chun cúirte chun do theach a athshealbhú

source: You must engage in the legal process if you don’t want your home repossessed
ga: Ní mór duit dul i ngleic leis an bpróiseas dlí má theastaíonn uait do theach a choimeád

source: In general, a lending institution may start the proceedings for repossession in either the Circuit Court or the High Court
ga: D’fhéadfadh an institiúid iasachta tús a chur le nósanna imeachta chun críocha athshealbhaithe i gceachtar den Chúirt Chuarda nó den Ard-Chúirt

source: However, if the mortgage was taken out on or after 1 December 2009, then a case for the repossession of the home arising from default on a housing mortgage loan must be first taken in the Circuit Court
ga: Má glacadh leis an morgáiste ar an 1 Nollaig 2009 nó ina dhiaidh sin, áfach, ní mór cás chun teach a athshealbhú mar gheall ar mhainneachtain in iasacht morgáiste tithíochta a dhéanamh sa Chúirt Chuarda i dtús báire

source: The Land and Conveyancing Law Reform Act 2013 (described above), has extended this rule to housing loan mortgages taken out before 1 December 2009. A housing loan mortgage is the usual kind of mortgage that individuals take out in order to build, buy or improve a house. (Cases involving repossession for default on other kinds of mortgages may continue to be taken in either the Circuit or the High Court.)
ga: Iasacht morgáiste tithíochta a bhíonn sa ghnáthmhorgáiste a ghlacann daoine aonair d’fhonn teach a thógáil, a cheannach nó a fheabhsú.(Is féidir cásanna lena mbaineann athshealbhú mar gheall ar mhainneachtain ar chineálacha morgáistí eile a thabhairt ós comhair na Cúirte Cuarda nó na hArd-Chúirte fós.)

source: The usual procedure is that the lending institution applies to the court for one or more orders – a possession order and/or a well-charging order
ga: Is éard atá sa nós imeachta coitianta ná go ndéanann an institiúid iasachta iarratas chun na cúirte ar ordú nó ar roinnt orduithe – ordú sealbhaithe agus/nó ordú iontaofa

source: These orders may be granted in the same proceedings
ga: D’fhéadfaí na horduithe seo a dheonú sna himeachtaí céanna

source: Generally, it is the practice of the courts to allow you some time to make arrangements to repay the money owed before making any final orders
ga: I gcoitinne, is é cleachtas na gcúirteanna am áirithe a cheadú duit chun socruithe a dhéanamh d’fhonn an t-airgead atá dlite a aisíoc sula ndéantar orduithe deiridh

source: If an order for possession or a well-charging order is made against you and you do not hand over possession or comply with other terms of the orders, the orders may be enforced by the Sheriff (in Dublin and Cork) or by the County Registrar in other areas
ga: Má dhéantar ordú sealbhaithe nó ordú iontaofa i do choinne agus mura ngéilleann tú sealbhú nó mura gcomhlíonann tú téarmaí eile na n-orduithe, d’fhéadfadh an Sirriam na horduithe a fhorfheidhmiú (i mBaile Átha Cliath agus i gCorcaigh) nó i gcás ceantar eile is é an Cláraitheoir Contae a dhéanfadh na horduithe a fhorfheidhmiú

source: The procedure in the Circuit Court is governed by the Rules of the Circuit Court as set out in the Circuit Court Rules (Actions for Possession and Wellcharging Relief) 2009. You may find this guide to possession proceedings (pdf) useful as you prepare to go to court
ga: Rialaítear an nós imeachta sa Chúirt Chuarda le Rialacha na Cúirte Cuarda mar atá leagtha amach i Rialacha na Cúirte Cuarda (Caingne um Shealbhú agus Faoiseamh Iontaofa) 2009: IR 264/2009 (pdf)

source: The Circuit Court process starts when the mortgage provider issues you with a civil bill
ga: Tosaítear próiseas na Cúirte Cuarda nuair a eisíonn an soláthraí morgáiste gnáthbhille sibhialta ort

source: This is usually accompanied by an affidavit setting out the claim that is being made against you
ga: De ghnáth bíonn mionnscríbhinn ag gabháil leis ag leagan amach an éilimh atá á dhéanamh i do choinne

source: The civil bill has a return date – that is the date on which the matter will come before the County Registrar
ga: Tá dáta fillte ar an ngnáthbhille sibhialta - sin an dáta a mbeidh an t-ábhar os comhair an Chláraitheora Contae

source: The civil bill must be served on you at least 21 days before the return date
ga: Ní mór an gnáthbhille sibhialta a sheirbheáil ort 21 lá ar a laghad roimh an dáta fillte

source: The mortgage provider may apply for a possession order and/or a well-charging order (see below)
ga: D’fhéadfadh an soláthraí morgáiste iarratas a dhéanamh ar ordú sealbhaithe agus/nó ar ordú iontaofa (féach thíos)

source: If you intend to fight the action taken by the mortgage provider to repossess your home, you must enter an appearance (there is a specific form for doing this) within 10 days of being served the civil bill
ga: Má tá sé ar intinn agat dul i gcoinne na caingne a thóg an soláthraí morgáiste chun do theach a athshealbhú ní mór duit láithreas a thaifeadadh (tá foirm shonrach ann chun é sin a dhéanamh) laistigh de 10 lá ó seirbheáladh an bille sibhialta ort

source: You must then file an affidavit replying to the mortgage provider’s claim and serve that on the mortgage provider at least four days before the return date
ga: Ansin ní mór duit mionnscríbhinn a chomhdú ag freagairt d’éileamh an tsoláthraí morgáiste agus é sin a sheirbheáil ar an soláthraí morgáiste ceithre lá roimh an dáta fillte ar a dhéanaí

source: When your case comes before the County Registrar it will be decided on the basis of what is in the affidavits
ga: Nuair a thagann do chás os comhair an Chláraitheora Contae déanfar cinneadh air ar bhunús a bhfuil sna mionnscríbhinní

source: Neither side has the right to give oral evidence except in specific circumstances
ga: Níl sé de cheart ag ceachtar taobh fianaise bhéil a thabhairt ach i gcúinsí eisceachtúla

source: However, you do have the right to cross examine the person who swore the affidavit
ga: Tá sé cheart agat, áfach, croscheistiú a dhéanamh ar an té a mhionnaigh an mionnscríbhinn

source: In order to do this, you must have given notice that you require this person to be present
ga: Chun é sin a dhéanamh, ní mór go mbeadh fógra tugtha agat ag iarraidh go mbeadh an duine sin i láthair

source: The County Registrar has the power to make a number of orders, including adjournments, notice to third parties and more time to file affidavits
ga: Tá sé de chumhacht ag an gCláraitheoir Contae roinnt orduithe a dhéanamh lena n-áirítear atráthú, fógra a thabhairt do thríú páirtithe agus tuilleadh ama chun mionnscríbhinní a chomhdú

source: Decisions by the County Registrar
ga: Cinntí an Chláraitheora Contae

source: The County Registrar may make an order for possession and/or a well-charging order if you have not entered an appearance
ga: Féadann an Cláraitheoir Contae ordú sealbhaithe a dhéanamh mura bhfuil láithreas taifeadta agat

source: The County Registrar can also make an order for possession, if you have entered an appearance and filed a replying affidavit, but your affidavit does not disclose a prima facie defence (this means that the affidavit does not show any obvious defence)
ga: Freisin féadann an Cláraitheoir Contae ordú sealbhaithe a dhéanamh má tá láithreas taifeadta agat agus mionnscríbhinn freagartha comhdaithe agat ach mura nochtann do mhionnscríbhinn cosaint prima facie (ciallaíonn sé sin nach léiríonn an mhionnscríbhinn aon chosaint shoiléir)

source: If you have entered an appearance and filed a replying affidavit which does disclose a prima facie defence, the case must be sent by the County Registrar for hearing by a judge
ga: Má tá láithreas taifeadta agat agus mionnscríbhinn freagartha comhdaithe agat a nochtann cosaint prima facie, ní mór don Chláraitheoir Contae an cás a chur ar aghaidh le héisteacht ag breitheamh

source: The judge may grant or refuse the order requested
ga: D’fhéadfadh an Breitheamh an t-ordú arna iarraidh a fhaomhadh nó a dhiúltú

source: The procedures for getting well-charging and possession orders in the High Court are similar
ga: Tá na nósanna imeachta a bhaineann le horduithe iontaofa agus sealbhaithe a fháil san Ard-Chúirt cosúil leis na cinn a bhíonn i gceist sa Chúirt Chuarda

source: The Master of the High Court has a similar (but not exactly the same) role as the County Registrar in the Circuit Court
ga: Tá ról Mháistir na hArd-Chúirte comhchosúil (ach ní díreach mar an gcéanna) le ról Chláraitheoir Contae na Cúirte Cuarda

source: The procedure is set out in Order 38 of the Rules of the Superior Courts
ga: Tá an nós imeachta leagtha amach in Ordú 38 de Rialacha na nUaschúirteanna

source: The lender may apply to the High Court for a possession order and, if necessary, a well-charging order
ga: D’fhéadfadh an t-iasachtóir iarratas a dhéanamh ar ordú sealbhaithe agus/nó ar ordú iontaofa más gá

source: The process involves the lender issuing a special summons
ga: Sa phróiseas seo déanann an t-iasachtóir toghairm speisialta a eisiúint

source: This is first dealt with by the Master of the High Court
ga: I dtús báire is é Máistir na hArd-Chúirte a dhéanann é seo a phlé

source: He sets a return date which may not be less than 7 days after the issuing of the summons
ga: Socraíonn sé dáta fillte tráth nach lú ná 7 lá i ndiaidh eisiúint na toghairme

source: The summons must then be served on you at least four days before the return date
ga: Ní mór an toghairm a sheirbheáil ort ceithre lá ar a laghad roimh an dáta fillte

source: The lender must file an affidavit setting out the facts of the claim in the Central Office of the High Court
ga: Ní mór don iasachtóir mionnscríbhinn a chomhdú ina leagfar amach fíricí an éilimh i bPríomhoifig na hArd-Chúirte

source: The hearing may be on affidavit only or oral evidence may be given
ga: Bainfidh an éisteacht le mionnscríbhinn amháin nó is féidir fianaise béil a thabhairt

source: The Master may grant or refuse the orders requested or may forward the case for hearing by a High Court judge
ga: Is féidir leis an Máistir na horduithe a iarrtar a dheonú nó a dhiúltú nó is féidir leis an cás a chur ar aghaidh le héisteacht ag breitheamh ón Ard-Chúirt

source: A mortgage suit is a court procedure which is taken by the holder of a security on property (for example, your mortgage lender) to recover a debt by forcing a sale of that property
ga: Is éard atá in Agra morgáiste ná nós imeachta cúirte a ghlacann sealbhóir urrúis ar réadmhaoin (mar shampla, d’iasachtóir morgáiste) chun fiach a aisghabháil trí dhíol na réadmhaoine sin a bhrú ar aghaidh

source: If a mortgage suit is successful, the court issues a well-charging order
ga: Má éiríonn le hagra morgáiste, eisíonn an chúirt ordú iontaofa

source: A well-charging order usually includes:
ga: Bíonn an méid seo a leanas san áireamh le hordú iontaofa de ghnáth:

source: • A declaration by the court that the debt owing to the person or institution (together with any interest and costs) taking the case is “well charged” on the property in question
ga: • Dearbhú ón gcúirt go bhfuil an fiach atá dlite don duine nó don institiúid (mar aon le hús nó costais ar bith) a bhfuil an cás á thabhairt aige/aici “iontaofa” maidir leis an réadmhaoin atá i gceist

source: • A direction that the property be sold (usually the court gives you time to pay the amount due before the order for sale becomes effective)
ga: • Treoir go ndíolfaí an réadmhaoin (go hiondúil tugann an chúirt roinnt ama duit an tsuim atá dlite a íoc sula gcuirfear an t-ordú díola i bhfeidhm)

source: • A direction that the Examiner’s Office take an account of all encumbrances and make an inquiry into their respective priorities
ga: • Treoir go dtógfadh Scrúdaitheoir na Cúirte na heirí ar fad san áireamh agus go ndéanfaí fiosrúchán ar na tosaíochtaí a bhaineann le gach ceann díobh

source: This can arise, for example, if you have more than one mortgage on a property or there is some arrangement whereby some of the proceeds of sale of the house must be used for other purposes
ga: D’fhéadfadh sé seo tarlú, mar shampla, má tá níos mó ná morgáiste amháin ar réadmhaoin agat nó má tá socrú áirithe ann trína chaithfear cuid d’fháltais díola an tí a úsáid chun críocha eile

source: The arrangements for the sale are also generally agreed through the Examiner’s Office
ga: Déantar na socruithe díola a aontú trí Oifig an Scrúdaitheora go hiondúil

source: The sale is usually by public auction
ga: Déantar díol an tí trí cheant poiblí de ghnáth

source: If the sale price is greater than the amount you owe, then the excess is paid over to you
ga: Má tá an praghas díola níos mó ná an méid atá dlite, déantar an farasbarr a íoc leat

source: If it is less, you are still liable to repay the shortfall
ga: Má tá an praghas níos lú, tá tú fós faoi dhliteanas an easnamh a aisíoc

source: If you manage to make a settlement with the lender and agree repayment terms, then the lender may apply to the court to discharge the well-charging order
ga: Má éiríonn leat teacht ar réiteach le d'iasachtóir agus téarmaí aisíocaíochtaí a chomhaontú, d'fhéadfadh an t-iasachtóir iarratas a dhéanamh chun na cúirte leis an ordú iontaofa a urscaoileadh

source: If you do not comply with the terms of the court orders, they may be enforced by the sheriff or the County Registrar
ga: Mura gcomhlíonann tú téarmaí na n-orduithe cúirte, d’fhéadfadh an Sirriam nó an Cláraitheoir iad a fhorfheidhmiú

source: If you owe money for any reason and the creditor is trying to get repayment, one of the options open to the creditor is to create a judgment mortgage on your property (your home or any other property you own)
ga: Má tá airgead le haisíoc agat ar chúis ar bith agus iarracht á dhéanamh ag creidiúnaí le haisíoc a fháil, ceann de na roghanna atá oscailte do chreidiúnaí ná morgáiste breithiúnais a chruthú ar do mhaoin (do theach nó maoin ar bith eile leat)

source: A judgment mortgage has broadly the same effect as a conventional mortgage on your home and can be enforced by way of a mortgage suit - see above
ga: Tá an éifeacht chéanna ag morgáiste breithiúnais go forleathan le morgáiste gnásúil ar do theach agus is féidir é a fhorghníomhú trí agra morgáiste (féach thuas)

source: First the creditor must get a judgment order, and then an execution order (usually a fi fa order) and if the execution order doesn’t result in payment of the debt the creditor may get a judgment mortgage on your property
ga: Caithfidh an creidiúnaí ordú breithiúnais i dtús báire, agus ordú forghníomhaithe ina dhiaidh sin (ordú fi fa go hiondúil) agus mura n-íoctar an fiachas le creidiúnaí tar éis ordú forghníomhaithe, d’fhéadfá morgáiste breithiúnais a fháil ar do mhaoin

source: The creditor must first get a court to decide that you do owe them money
ga: I dtús báire, caithfidh an creidiúnaí cinneadh cúirte a fháil go bhfuil airgead dlite dóibh

source: This is called a judgment order
ga: Ordú breithiúnais a thugtar ar a leithéidí
